{"article0": {"title": "Tech stocks: The three 'horses' to bet on in tightening AI race", "blurb": "In the year's transition from the first quarter to the second quarter, is 2024 shaping up to be another breakout year for tech as far as AI catalysts are concerned? Public Ventures President and Chief Market Strategist Lou Basenese joins Yahoo Finance in-studio to talk about tech stock leaders with broadening use cases for artificial intelligence, highlighting Alphabet (GOOG, GOOGL), Microsoft (MSFT), and Apple (AAPL) \"You have to play a basket. You're not going to be able to pick a single horse in this AI race and work out as well as it did for Nvidia (NVDA) last year,\" Basenese says. \"Let's just face it, Nvidia can't have the same run... this year as it did last year. It just would become too big of a company.\" For more expert insight and the latest market action, click&nbsp;here&nbsp;to watch this full episode of Market Domination. Editor's note: This article was written by Luke Carberry Mogan.", "link": "/video/tech-stocks-three-horses-bet-202326655.html", "label": "NEGATIVE", "score": 0.9984295964241028}, "article1": {"title": "How the 'Magnificent 7' became the 'Mag 4'", "blurb": "As the first quarter of 2024 draws to a close, the once-dominant \"Magnificent Seven\" tech stocks appear to be fragmenting. The group, which previously consisted of seven leading technology companies, has now dwindled to the \"Magnificent Four.\" Nvidia (NVDA), Microsoft (MSFT), Meta (META), and Amazon (AMZN) continue to spearhead gains, while Tesla (TSLA), Apple (AAPL), and Alphabet (GOOG, GOOGL) have underperformed compared to their peers. Yahoo Finance's Jared Blikre and Madison Mills discuss the details. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith", "link": "/video/magnificent-7-became-mag-4-162828133.html", "label": "NEGATIVE", "score": 0.9979908466339111}, "article2": {"title": "AI-powered stocks will face increasingly stiff competition: Analyst", "blurb": "The tech sector has been on a run with chip powerhouse Nvidia (NVDA) leading the charge with an incredible 86% gain year-to-date. Many of the big names in tech — Amazon (AMZN), Apple (AAPL), Alphabet (GOOG, GOOGL), Nvidia (NVDA), Meta (META), Microsoft (MSFT), and Tesla (TSLA) — have been grouped together and referred to as The Magnificent Seven, but some, like Apple and Tesla, have fallen off from great heights. Now, investors are chattering over whether or not tech can weather any potential storms in the market. TECHnalysis Research President and Chief Analyst Bob O'Donnell joins Yahoo Finance to break down the recent movements in the tech sector and how its major players can operate moving forward. O'Donnell talks about potential leaders in tech for the long-term: \"The one thing is, Nvidia's got 90% share. Anybody who's got 90% share is going to lose a little share. But, that doesn't mean they still can't grow organically from where they are. You're just going to see a lot more competitors. If we look at it collectively, I still think there is several years of growth in the collective semiconductor market for AI-powered stuff. So, you're going to see, as I said, I talked about AMD (AMD). Intel (INTC) will be interesting to see.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino", "link": "/video/ai-powered-stocks-face-increasingly-160021713.html", "label": "POSITIVE", "score": 0.992164134979248}, "article3": {"title": "Google Agrees to Delete Web Browsing Data as It Settles ‘Incognito’&nbsp;Lawsuit", "blurb": "(Bloomberg) -- Google said it would delete millions of records of users’ browsing activities as part of a settlement of a class-action lawsuit that alleged it tracked people without their knowledge. Most Read from BloombergA Million Simulations, One Verdict for US Economy: Debt Danger AheadTrump Media’s Business Doesn’t MatterErdogan Suffers Historic Loss in Turkey Municipal ElectionsCaribbean Golden Passport Cost Soars to $200,000 on EU CrackdownTrump Pays $175 Million Bond to Avert Asset Seizu", "link": "/news/google-agrees-delete-browsing-data-200847735.html", "label": "NEGATIVE", "score": 0.995894193649292}, "article4": {"title": "As Alphabet CFO Search Drags On, Google Stock Underperforms Meta, Amazon, Microsoft", "blurb": "Shares in Google-parent Alphabet lagged other Big Tech companies in the first quarter of 2023 amid a lingering search for a new chief financial officer.", "link": "/m/03c48807-ca5f-3f54-8631-06411f74611f/as-alphabet-cfo-search-drags.html", "label": "NEGATIVE", "score": 0.9985388517379761}, "article5": {"title": "Google to delete billions of browser records to settle ‘Incognito’ lawsuit", "blurb": "Google will delete billions of data records as part of a settlement for a lawsuit that accused the tech giant of improperly tracking the web-browsing habits of users who thought they were browsing the internet privately.", "link": "/news/google-delete-billions-browser-records-192908005.html", "label": "NEGATIVE", "score": 0.9996716976165771}, "article6": {"title": "Google to purge billions of files containing personal data in settlement of Chrome privacy case", "blurb": "Google has agreed to purge billions of records containing personal information collected from more than 136 million people in the U.S. surfing the internet through its Chrome web browser.  The massive housecleaning comes as part of a settlement in a lawsuit accusing the search giant of illegal surveillance.  The details of the deal emerged in a court filing Monday, more than three months after Google and the attorneys handling the class-action case disclosed they had resolved a June 2020 lawsuit targeting Chrome's privacy controls.", "link": "/news/google-purge-billions-files-containing-191138438.html", "label": "NEGATIVE", "score": 0.9973822236061096}, "article7": {"title": "REFILE-UPDATE 1-Google to destroy browsing data to settle consumer privacy lawsuit", "blurb": "Google agreed to destroy billions of data records to settle a lawsuit claiming it secretly tracked the internet use of people who thought they were browsing privately.  Terms of the settlement were filed on Monday in the Oakland, California federal court, and require approval by U.S. District Judge Yvonne Gonzalez Rogers.  Google is paying no damages, but users may sue the company individually for damages.", "link": "/news/1-google-destroy-browsing-data-172510346.html", "label": "NEGATIVE", "score": 0.9974337220191956}, "article8": {"title": "Alphabet Stock Is in Line for Record Close. Google Is Erasing Private Browsing Data.", "blurb": "Alphabet’s  Google said in a Monday court filing that it will delete some data from users’ browsing histories, among other steps, under a settlement of a consumer-privacy lawsuit it agreed to in December.  The $5 billion suit alleged that the search engine tracked the internet use of people who were using “incognito” mode, a type of search that doesn’t save web browsing history on the user’s computer.  Details of that settlement came out on Monday, listing actions that the company will take in regard to private browsing.", "link": "/m/742da501-0622-3ee8-a742-770613e0e6f7/alphabet-stock-is-in-line-for.html", "label": "NEGATIVE", "score": 0.9967104196548462}, "article9": {"title": "Google to destroy browsing data to settle consumer privacy lawsuit", "blurb": "Google agreed to destroy billions of data records to settle a lawsuit claiming it secretly tracked the internet use of people who thought they were browsing privately.  Terms of the settlement were filed on Monday in the Oakland, California federal court, and require approval by U.S. District Judge Yvonne Gonzalez Rogers.  Google is paying no damages, but users may sue the company individually for damages.", "link": "/news/google-destroy-browsing-data-settle-162937776.html", "label": "NEGATIVE", "score": 0.9974337220191956}}