{"article0": {"title": "Jim Cramer is Talking About Trump Media and 10 Other Stocks", "blurb": "In this article, we will take a detailed look at Jim Cramer is Talking About Trump Media and 10 Other Stocks. For a quick overview of such stocks, read our article Jim Cramer is Talking About These 5 Stocks. Jim Cramer in his latest program on CNBC tried to get to the bottom of the recent market decline amid rising yields […]", "link": "/news/jim-cramer-talking-trump-media-141412379.html", "label": "POSITIVE", "score": 0.9700010418891907}, "article1": {"title": "Amazon (AMZN) Expands Cloud Credits for Startups Using AI Models", "blurb": "Amazon's (AMZN) AWS is set to expand free credits to startups for using AI models from other providers on Amazon Bedrock.", "link": "/news/amazon-amzn-expands-cloud-credits-141100744.html", "label": "NEGATIVE", "score": 0.9958609938621521}, "article2": {"title": "Nvidia, Google, Palantir And 6 IPO Stocks Take On Troubled Market", "blurb": "As the market encounters pressure, Nvidia, Google and six IPO Leaders navigate the turbulence and test breakouts and buy zones.", "link": "/m/e789016b-18ca-34d5-b876-e8c657feaf98/nvidia%2C-google%2C-palantir-and.html", "label": "POSITIVE", "score": 0.8543751239776611}, "article3": {"title": "An AI-Rally for Software Makers Will Demand Investor Patience", "blurb": "(Bloomberg) -- Investors need more patience for the euphoria about artificial intelligence to lift the stocks of software makers.Most Read from BloombergA Million Simulations, One Verdict for US Economy: Debt Danger AheadTrump Media’s Business Doesn’t MatterTSMC Facilities to Resume Production Overnight After QuakeTrump Got His $175 Million Bond From a Billionaire Fan’s CompanyKim Jong Un Faces Annihilation in Most Korea War ScenariosAt a time when surging demand for AI infrastructure are spurri", "link": "/news/ai-rally-software-makers-demand-114712109.html", "label": "NEGATIVE", "score": 0.9864582419395447}, "article4": {"title": "Google to delete user records gathered from browser private mode", "blurb": "The tech giant has agreed to the process to settle a multibillion-dollar lawsuit.", "link": "/news/google-delete-user-records-gathered-122013539.html", "label": "NEGATIVE", "score": 0.9535722136497498}, "article5": {"title": "15 Countries with Highest Percentage of Millionaires in the World", "blurb": "In this article, we will talk about the 15 countries with highest percentage of millionaires in the world. If you want to skip our detailed analysis, head straight to the 5 Countries with Highest Percentage of Millionaires in the World. Global Millionaires: An Outlook Most of the millionaires around the world are self-made. In recent […]", "link": "/news/15-countries-highest-percentage-millionaires-231031176.html", "label": "NEGATIVE", "score": 0.9179834723472595}, "article6": {"title": "Alphabet (GOOGL) Stock Moves -0.6%: What You Should Know", "blurb": "Alphabet (GOOGL) reachead $154.56 at the closing of the latest trading day, reflecting a -0.6% change compared to its last close.", "link": "/news/alphabet-googl-stock-moves-0-214522415.html", "label": "NEGATIVE", "score": 0.9914592504501343}, "article7": {"title": "Alphabet Inc. (GOOG) Stock Moves -0.4%: What You Should Know", "blurb": "The latest trading day saw Alphabet Inc. (GOOG) settling at $155.87, representing a -0.4% change from its previous close.", "link": "/news/alphabet-inc-goog-stock-moves-214520894.html", "label": "NEGATIVE", "score": 0.9944912195205688}, "article8": {"title": "Dow Jones Leader Microsoft, Magnificent Seven Stock Google Boast Rising Profit Estimates", "blurb": "Dow Jones software giant Microsoft, along with Google stock and Deckers, boast rising profit estimates in the stock market today.", "link": "/m/f1c00c68-ff1f-3a96-9672-0d6d388b0a4e/dow-jones-leader-microsoft%2C.html", "label": "POSITIVE", "score": 0.997706413269043}, "article9": {"title": "Bullish Diagonal Spread Looks For Low-Cost Exposure To Google", "blurb": "Alphabet stock quietly broke out to an all-time high yesterday, closing up 3%.  Today, Google stock is down but it's an inside day that's retaining the majority of Monday's gains.  Investors who think the Alphabet stock will continue to rally could do so in a reduced risk way, with the use of options.", "link": "/m/0c6c72f7-2e29-38a0-b174-9e77ed4bf745/bullish-diagonal-spread-looks.html", "label": "POSITIVE", "score": 0.8334671854972839}}